src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СебестоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДопРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДопРасходовБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРеглБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДСРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорРазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаСебестоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовСписания</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПродажи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяАктивовПассивов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.КорректировкаНалоговогоНазначенияЗапасов</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаОбособленногоУчетаЗапасов</types>
      <types>DocumentRef.ОтчетОРозничнойВыручке</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.РасчетСебестоимостиТоваров</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ПорчаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаСебестоимостиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ЗаданияКРасчетуСебестоимости/ЗаданияКРасчетуСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКРасчетуСебестоимости</name>
  <comment>Технический регистр, содержит в себе данные о документах, которые необходимо пересчитать офлайновому механизму расчета себестоимости.</comment>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/СебестоимостьТоваров/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если РасчетСебестоимости.ДвиженияЗаписываютсяРасчетомСебестоимости(ЭтотОбъект)
	 ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	РасчетСебестоимости.СохранитьДвиженияСформированныеРасчетомСебестоимости(ЭтотОбъект, Замещение);
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Себестоимость.Период                        КАК Период,
	|	Себестоимость.Регистратор                   КАК Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	Себестоимость.РазделУчета                   КАК РазделУчета,
	|	Себестоимость.ВидЗапасов                    КАК ВидЗапасов,
	|	Себестоимость.Организация                   КАК Организация,
	|
	|	Себестоимость.Количество             КАК Количество,
	|	Себестоимость.Стоимость              КАК Стоимость,
	|	Себестоимость.СтоимостьБезНДС        КАК СтоимостьБезНДС,
	|	Себестоимость.СуммаДопРасходов       КАК СуммаДопРасходов,
	|	Себестоимость.СуммаДопРасходовБезНДС КАК СуммаДопРасходовБезНДС,
	|	Себестоимость.СтоимостьРегл          КАК СтоимостьРегл,
	|	Себестоимость.СтоимостьРеглБезНДС    КАК СтоимостьРеглБезНДС,
	|	Себестоимость.НДСРегл                КАК НДСРегл,
	|	Себестоимость.ПостояннаяРазница      КАК ПостояннаяРазница,
	|	Себестоимость.ВременнаяРазница       КАК ВременнаяРазница,
	|
	|	Себестоимость.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	Себестоимость.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Себестоимость.КорРазделУчета                КАК КорРазделУчета,
	|	Себестоимость.КорВидЗапасов                 КАК КорВидЗапасов,
	|	Себестоимость.КорОрганизация                КАК КорОрганизация,
	|	Себестоимость.КорСтоимость                  КАК КорСтоимость,
	|	Себестоимость.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	Себестоимость.ЗаказКлиента                  КАК ЗаказКлиента,
	|	Себестоимость.Подразделение                 КАК Подразделение,
	|	Себестоимость.АналитикаРасходов             КАК АналитикаРасходов,
	|	Себестоимость.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|	Себестоимость.СтатьяДоходов                 КАК СтатьяДоходов,
	|	Себестоимость.АналитикаДоходов              КАК АналитикаДоходов,
	|	Себестоимость.ПериодПродажи                 КАК ПериодПродажи,
	|	Себестоимость.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|	Себестоимость.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	Себестоимость.ДокументДвижения              КАК ДокументДвижения,
	|	Себестоимость.НалоговоеНазначение           КАК НалоговоеНазначение,
	|	Себестоимость.КорНалоговоеНазначение        КАК КорНалоговоеНазначение,
	|	Себестоимость.ИдентификаторСтроки           КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ СебестоимостьТоваровПередЗаписью
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.Регистратор = &Регистратор
	|");
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если РасчетСебестоимости.ДвиженияЗаписываютсяРасчетомСебестоимости(ЭтотОбъект)
	 ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ ОбменДанными.Загрузка
	 ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК МЕСЯЦ,
	|	Таблица.Организация                  КАК Организация,
	|	Таблица.Регистратор                  КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ
	|		Себестоимость.Период                        КАК Период,
	|		Себестоимость.Регистратор                   КАК Регистратор,
	|		Себестоимость.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|		Себестоимость.РазделУчета                   КАК РазделУчета,
	|		Себестоимость.ВидЗапасов                    КАК ВидЗапасов,
	|		Себестоимость.Организация                   КАК Организация,
	|
	|		Себестоимость.Количество             КАК Количество,
	|		Себестоимость.Стоимость              КАК Стоимость,
	|		Себестоимость.СтоимостьБезНДС        КАК СтоимостьБезНДС,
	|		Себестоимость.СуммаДопРасходов       КАК СуммаДопРасходов,
	|		Себестоимость.СуммаДопРасходовБезНДС КАК СуммаДопРасходовБезНДС,
	|		Себестоимость.СтоимостьРегл          КАК СтоимостьРегл,
	|		Себестоимость.СтоимостьРеглБезНДС    КАК СтоимостьРеглБезНДС,
	|		Себестоимость.НДСРегл                КАК НДСРегл,
	|		Себестоимость.ПостояннаяРазница      КАК ПостояннаяРазница,
	|		Себестоимость.ВременнаяРазница       КАК ВременнаяРазница,
	|
	|		Себестоимость.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|		Себестоимость.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Себестоимость.КорРазделУчета                КАК КорРазделУчета,
	|		Себестоимость.КорВидЗапасов                 КАК КорВидЗапасов,
	|		Себестоимость.КорОрганизация                КАК КорОрганизация,
	|		Себестоимость.КорСтоимость                  КАК КорСтоимость,
	|		Себестоимость.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|		Себестоимость.ЗаказКлиента                  КАК ЗаказКлиента,
	|		Себестоимость.Подразделение                 КАК Подразделение,
	|		Себестоимость.АналитикаРасходов             КАК АналитикаРасходов,
	|		Себестоимость.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|		Себестоимость.СтатьяДоходов                 КАК СтатьяДоходов,
	|		Себестоимость.АналитикаДоходов              КАК АналитикаДоходов,
	|		Себестоимость.ПериодПродажи                 КАК ПериодПродажи,
	|		Себестоимость.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|		Себестоимость.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|		Себестоимость.ДокументДвижения              КАК ДокументДвижения,
	|		Себестоимость.НалоговоеНазначение           КАК НалоговоеНазначение,
	|		Себестоимость.КорНалоговоеНазначение        КАК КорНалоговоеНазначение,
	|		Себестоимость.ИдентификаторСтроки           КАК ИдентификаторСтроки
	|	ИЗ
	|		СебестоимостьТоваровПередЗаписью КАК Себестоимость
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Себестоимость.Период                        КАК Период,
	|		Себестоимость.Регистратор                   КАК Регистратор,
	|		Себестоимость.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|		Себестоимость.РазделУчета                   КАК РазделУчета,
	|		Себестоимость.ВидЗапасов                    КАК ВидЗапасов,
	|		Себестоимость.Организация                   КАК Организация,
	|
	|		-Себестоимость.Количество             КАК Количество,
	|		-Себестоимость.Стоимость              КАК Стоимость,
	|		-Себестоимость.СтоимостьБезНДС        КАК СтоимостьБезНДС,
	|		-Себестоимость.СуммаДопРасходов       КАК СуммаДопРасходов,
	|		-Себестоимость.СуммаДопРасходовБезНДС КАК СуммаДопРасходовБезНДС,
	|		-Себестоимость.СтоимостьРегл          КАК СтоимостьРегл,
	|		-Себестоимость.СтоимостьРеглБезНДС    КАК СтоимостьРеглБезНДС,
	|		-Себестоимость.НДСРегл                КАК НДСРегл,
	|		-Себестоимость.ПостояннаяРазница      КАК ПостояннаяРазница,
	|		-Себестоимость.ВременнаяРазница       КАК ВременнаяРазница,
	|
	|		Себестоимость.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|		Себестоимость.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Себестоимость.КорРазделУчета                КАК КорРазделУчета,
	|		Себестоимость.КорВидЗапасов                 КАК КорВидЗапасов,
	|		Себестоимость.КорОрганизация                КАК КорОрганизация,
	|		Себестоимость.КорСтоимость                  КАК КорСтоимость,
	|		Себестоимость.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|		Себестоимость.ЗаказКлиента                  КАК ЗаказКлиента,
	|		Себестоимость.Подразделение                 КАК Подразделение,
	|		Себестоимость.АналитикаРасходов             КАК АналитикаРасходов,
	|		Себестоимость.СтатьяРасходовСписания        КАК СтатьяРасходовСписания,
	|		Себестоимость.СтатьяДоходов                 КАК СтатьяДоходов,
	|		Себестоимость.АналитикаДоходов              КАК АналитикаДоходов,
	|		Себестоимость.ПериодПродажи                 КАК ПериодПродажи,
	|		Себестоимость.СтатьяАктивовПассивов         КАК СтатьяАктивовПассивов,
	|		Себестоимость.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|		Себестоимость.ДокументДвижения              КАК ДокументДвижения,
	|		Себестоимость.НалоговоеНазначение           КАК НалоговоеНазначение,
	|		Себестоимость.КорНалоговоеНазначение        КАК КорНалоговоеНазначение,
	|		Себестоимость.ИдентификаторСтроки           КАК ИдентификаторСтроки
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ГДЕ
	|		Себестоимость.Регистратор = &Регистратор
	|	) КАК Таблица
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ),
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.АналитикаУчетаНоменклатуры,
	|	Таблица.РазделУчета,
	|	Таблица.ВидЗапасов,
	|	Таблица.Организация,
	|	Таблица.ХозяйственнаяОперация,
	|	Таблица.КорАналитикаУчетаНоменклатуры,
	|	Таблица.КорРазделУчета,
	|	Таблица.КорВидЗапасов,
	|	Таблица.КорОрганизация,
	|	Таблица.КорСтоимость,
	|	Таблица.АналитикаУчетаПоПартнерам,
	|	Таблица.ЗаказКлиента,
	|	Таблица.Подразделение,
	|	Таблица.АналитикаРасходов,
	|	Таблица.СтатьяРасходовСписания,
	|	Таблица.СтатьяДоходов,
	|	Таблица.АналитикаДоходов,
	|	Таблица.ПериодПродажи,
	|	Таблица.СтатьяАктивовПассивов,
	|	Таблица.АналитикаАктивовПассивов,
	|	Таблица.ДокументДвижения,
	|	Таблица.НалоговоеНазначение,
	|	Таблица.КорНалоговоеНазначение,
	|	Таблица.ИдентификаторСтроки
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.Количество) <> 0
	|	ИЛИ СУММА(Таблица.Стоимость) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.СуммаДопРасходов) <> 0
	|	ИЛИ СУММА(Таблица.СуммаДопРасходовБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьРегл) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьРеглБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.НДСРегл) <> 0
	|	ИЛИ СУММА(Таблица.ПостояннаяРазница) <> 0
	|	ИЛИ СУММА(Таблица.ВременнаяРазница) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СебестоимостьТоваровПередЗаписью
	|");
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	РегистрыСведений.ЗаданияКРасчетуСебестоимости.СоздатьЗаписиРегистраПоДаннымВыборки(Запрос.Выполнить().Выбрать());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
